====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
HTDemucs                                           [1, 4, 2, 264600]         --
├─ModuleList: 1-8                                  --                        (recursive)
│    └─HEncLayer: 2-1                              [1, 48, 85995]            --
│    │    └─Conv1d: 3-1                            [1, 48, 85995]            (816)
│    │    └─Identity: 3-2                          [1, 48, 85995]            --
│    │    └─DConv: 3-3                             [1, 48, 85995]            (3,588)
│    │    └─Conv1d: 3-4                            [1, 96, 85995]            (4,704)
│    │    └─Identity: 3-5                          [1, 96, 85995]            --
├─ModuleList: 1-9                                  --                        (recursive)
│    └─HEncLayer: 2-2                              [1, 48, 512, 336]         --
│    │    └─Conv2d: 3-6                            [1, 48, 512, 336]         (1,584)
│    │    └─Identity: 3-7                          [1, 48, 512, 336]         --
│    │    └─DConv: 3-8                             [512, 48, 336]            (3,588)
│    │    └─Conv2d: 3-9                            [1, 96, 512, 336]         (4,704)
│    │    └─Identity: 3-10                         [1, 96, 512, 336]         --
├─ScaledEmbedding: 1-3                             [512, 48]                 --
│    └─Embedding: 2-3                              [512, 48]                 (24,576)
├─ModuleList: 1-8                                  --                        (recursive)
│    └─HEncLayer: 2-4                              [1, 96, 21499]            --
│    │    └─Conv1d: 3-11                           [1, 96, 21499]            (36,960)
│    │    └─Identity: 3-12                         [1, 96, 21499]            --
│    │    └─DConv: 3-13                            [1, 96, 21499]            (12,936)
│    │    └─Conv1d: 3-14                           [1, 192, 21499]           (18,624)
│    │    └─Identity: 3-15                         [1, 192, 21499]           --
├─ModuleList: 1-9                                  --                        (recursive)
│    └─HEncLayer: 2-5                              [1, 96, 128, 336]         --
│    │    └─Conv2d: 3-16                           [1, 96, 128, 336]         (36,960)
│    │    └─Identity: 3-17                         [1, 96, 128, 336]         --
│    │    └─DConv: 3-18                            [128, 96, 336]            (12,936)
│    │    └─Conv2d: 3-19                           [1, 192, 128, 336]        (18,624)
│    │    └─Identity: 3-20                         [1, 192, 128, 336]        --
├─ModuleList: 1-8                                  --                        (recursive)
│    └─HEncLayer: 2-6                              [1, 192, 5375]            --
│    │    └─Conv1d: 3-21                           [1, 192, 5375]            (147,648)
│    │    └─Identity: 3-22                         [1, 192, 5375]            --
│    │    └─DConv: 3-23                            [1, 192, 5375]            (48,912)
│    │    └─Conv1d: 3-24                           [1, 384, 5375]            (74,112)
│    │    └─Identity: 3-25                         [1, 384, 5375]            --
├─ModuleList: 1-9                                  --                        (recursive)
│    └─HEncLayer: 2-7                              [1, 192, 32, 336]         --
│    │    └─Conv2d: 3-26                           [1, 192, 32, 336]         (147,648)
│    │    └─Identity: 3-27                         [1, 192, 32, 336]         --
│    │    └─DConv: 3-28                            [32, 192, 336]            (48,912)
│    │    └─Conv2d: 3-29                           [1, 384, 32, 336]         (74,112)
│    │    └─Identity: 3-30                         [1, 384, 32, 336]         --
├─ModuleList: 1-8                                  --                        (recursive)
│    └─HEncLayer: 2-8                              [1, 384, 1344]            --
│    │    └─Conv1d: 3-31                           [1, 384, 1344]            (590,208)
│    │    └─Identity: 3-32                         [1, 384, 1344]            --
│    │    └─DConv: 3-33                            [1, 384, 1344]            (189,984)
│    │    └─Conv1d: 3-34                           [1, 768, 1344]            (295,680)
│    │    └─Identity: 3-35                         [1, 768, 1344]            --
├─ModuleList: 1-9                                  --                        (recursive)
│    └─HEncLayer: 2-9                              [1, 384, 8, 336]          --
│    │    └─Conv2d: 3-36                           [1, 384, 8, 336]          (590,208)
│    │    └─Identity: 3-37                         [1, 384, 8, 336]          --
│    │    └─DConv: 3-38                            [8, 384, 336]             (189,984)
│    │    └─Conv2d: 3-39                           [1, 768, 8, 336]          (295,680)
│    │    └─Identity: 3-40                         [1, 768, 8, 336]          --
├─Conv1d: 1-10                                     [1, 512, 2688]            (197,120)
├─Conv1d: 1-11                                     [1, 512, 1344]            (197,120)
├─CrossTransformerEncoder: 1-12                    [1, 512, 8, 336]          --
│    └─LayerNorm: 2-10                             [1, 2688, 512]            (1,024)
│    └─LayerNorm: 2-11                             [1, 1344, 512]            (1,024)
│    └─ModuleList: 2-20                            --                        (recursive)
│    │    └─MyTransformerEncoderLayer: 3-41        [1, 2688, 512]            (3,154,432)
│    └─ModuleList: 2-21                            --                        (recursive)
│    │    └─MyTransformerEncoderLayer: 3-42        [1, 1344, 512]            (3,154,432)
│    └─ModuleList: 2-20                            --                        (recursive)
│    │    └─CrossTransformerEncoderLayer: 3-43     [1, 2688, 512]            (3,155,456)
│    └─ModuleList: 2-21                            --                        (recursive)
│    │    └─CrossTransformerEncoderLayer: 3-44     [1, 1344, 512]            (3,155,456)
│    └─ModuleList: 2-20                            --                        (recursive)
│    │    └─MyTransformerEncoderLayer: 3-45        [1, 2688, 512]            (3,154,432)
│    └─ModuleList: 2-21                            --                        (recursive)
│    │    └─MyTransformerEncoderLayer: 3-46        [1, 1344, 512]            (3,154,432)
│    └─ModuleList: 2-20                            --                        (recursive)
│    │    └─CrossTransformerEncoderLayer: 3-47     [1, 2688, 512]            (3,155,456)
│    └─ModuleList: 2-21                            --                        (recursive)
│    │    └─CrossTransformerEncoderLayer: 3-48     [1, 1344, 512]            (3,155,456)
│    └─ModuleList: 2-20                            --                        (recursive)
│    │    └─MyTransformerEncoderLayer: 3-49        [1, 2688, 512]            (3,154,432)
│    └─ModuleList: 2-21                            --                        (recursive)
│    │    └─MyTransformerEncoderLayer: 3-50        [1, 1344, 512]            (3,154,432)
├─Conv1d: 1-13                                     [1, 384, 2688]            (196,992)
├─Conv1d: 1-14                                     [1, 384, 1344]            (196,992)
├─ModuleList: 1-21                                 --                        (recursive)
│    └─HDecLayer: 2-22                             [1, 192, 32, 336]         --
│    │    └─Conv2d: 3-51                           [1, 768, 8, 336]          (2,654,976)
│    │    └─Identity: 3-52                         [1, 768, 8, 336]          --
│    │    └─DConv: 3-53                            [8, 384, 336]             (189,984)
│    │    └─ConvTranspose2d: 3-54                  [1, 192, 36, 336]         (590,016)
│    │    └─Identity: 3-55                         [1, 192, 36, 336]         --
├─ModuleList: 1-22                                 --                        (recursive)
│    └─HDecLayer: 2-23                             [1, 192, 5375]            --
│    │    └─Conv1d: 3-56                           [1, 768, 1344]            (885,504)
│    │    └─Identity: 3-57                         [1, 768, 1344]            --
│    │    └─DConv: 3-58                            [1, 384, 1344]            (189,984)
│    │    └─ConvTranspose1d: 3-59                  [1, 192, 5380]            (590,016)
│    │    └─Identity: 3-60                         [1, 192, 5380]            --
├─ModuleList: 1-21                                 --                        (recursive)
│    └─HDecLayer: 2-24                             [1, 96, 128, 336]         --
│    │    └─Conv2d: 3-61                           [1, 384, 32, 336]         (663,936)
│    │    └─Identity: 3-62                         [1, 384, 32, 336]         --
│    │    └─DConv: 3-63                            [32, 192, 336]            (48,912)
│    │    └─ConvTranspose2d: 3-64                  [1, 96, 132, 336]         (147,552)
│    │    └─Identity: 3-65                         [1, 96, 132, 336]         --
├─ModuleList: 1-22                                 --                        (recursive)
│    └─HDecLayer: 2-25                             [1, 96, 21499]            --
│    │    └─Conv1d: 3-66                           [1, 384, 5375]            (221,568)
│    │    └─Identity: 3-67                         [1, 384, 5375]            --
│    │    └─DConv: 3-68                            [1, 192, 5375]            (48,912)
│    │    └─ConvTranspose1d: 3-69                  [1, 96, 21504]            (147,552)
│    │    └─Identity: 3-70                         [1, 96, 21504]            --
├─ModuleList: 1-21                                 --                        (recursive)
│    └─HDecLayer: 2-26                             [1, 48, 512, 336]         --
│    │    └─Conv2d: 3-71                           [1, 192, 128, 336]        (166,080)
│    │    └─Identity: 3-72                         [1, 192, 128, 336]        --
│    │    └─DConv: 3-73                            [128, 96, 336]            (12,936)
│    │    └─ConvTranspose2d: 3-74                  [1, 48, 516, 336]         (36,912)
│    │    └─Identity: 3-75                         [1, 48, 516, 336]         --
├─ModuleList: 1-22                                 --                        (recursive)
│    └─HDecLayer: 2-27                             [1, 48, 85995]            --
│    │    └─Conv1d: 3-76                           [1, 192, 21499]           (55,488)
│    │    └─Identity: 3-77                         [1, 192, 21499]           --
│    │    └─DConv: 3-78                            [1, 96, 21499]            (12,936)
│    │    └─ConvTranspose1d: 3-79                  [1, 48, 86000]            (36,912)
│    │    └─Identity: 3-80                         [1, 48, 86000]            --
├─ModuleList: 1-21                                 --                        (recursive)
│    └─HDecLayer: 2-28                             [1, 16, 2048, 336]        --
│    │    └─Conv2d: 3-81                           [1, 96, 512, 336]         (41,568)
│    │    └─Identity: 3-82                         [1, 96, 512, 336]         --
│    │    └─DConv: 3-83                            [512, 48, 336]            (3,588)
│    │    └─ConvTranspose2d: 3-84                  [1, 16, 2052, 336]        (6,160)
│    │    └─Identity: 3-85                         [1, 16, 2052, 336]        --
├─ModuleList: 1-22                                 --                        (recursive)
│    └─HDecLayer: 2-29                             [1, 8, 343980]            --
│    │    └─Conv1d: 3-86                           [1, 96, 85995]            (13,920)
│    │    └─Identity: 3-87                         [1, 96, 85995]            --
│    │    └─DConv: 3-88                            [1, 48, 85995]            (3,588)
│    │    └─ConvTranspose1d: 3-89                  [1, 8, 343984]            (3,080)
│    │    └─Identity: 3-90                         [1, 8, 343984]            --
====================================================================================================
Total params: 41,984,456
Trainable params: 0
Non-trainable params: 41,984,456
Total mult-adds (Units.GIGABYTES): 88.31
====================================================================================================
Input size (MB): 2.12
Forward/backward pass size (MB): 6021.99
Params size (MB): 125.91
Estimated Total Size (MB): 6150.02
====================================================================================================